Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РуководителиСУО/РуководителиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РуководителиСУО</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРуководства</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/СотрудникиСУО/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьПравоИзмененияСотрудников = УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеСотрудниковСУО",,Пользователи.ТекущийПользователь());
	
	Если НЕ ЕстьПравоИзмененияСотрудников Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РуководителиСУО.ОбъектРуководства
			|ИЗ
			|	РегистрСведений.РуководителиСУО КАК РуководителиСУО
			|ГДЕ
			|	РуководителиСУО.Пользователь = &Пользователь
			|	И (РуководителиСУО.ОбъектРуководства = &Организация
			|	ИЛИ РуководителиСУО.ОбъектРуководства = &ПодразделениеОрганизации
			|	ИЛИ РуководителиСУО.ОбъектРуководства = &ПодразделениеПредприятия)";

		Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ТекущийОбъект.ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("ПодразделениеПредприятия", ТекущийОбъект.ПодразделениеПредприятия);
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

		Результат = Запрос.Выполнить();

		Если Результат.Пустой() Тогда
			
			Текст = НСтр("ru = 'Нарушение прав доступа'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
			Возврат;
			
		КонецЕсли;

	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Пользователь) Тогда
		
		Если НЕ ЗначениеЗаполнено(ИмяНовогоПользователя) Тогда
			
			Текст = НСтр("ru = 'Укажите имя пользователя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
			Возврат;
			
		КонецЕсли;
		
		НовыйПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользовательОбъект.Наименование = ИмяНовогоПользователя;
		НовыйПользовательОбъект.Записать();
		
		ТекущийОбъект.Пользователь = НовыйПользовательОбъект.Ссылка;
				
		ПользователиСлужебный.ОбновитьСоставыГруппПользователей(Справочники.ГруппыПользователей.ВсеПользователи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УказатьСуществующегоПользователя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УказатьСуществующегоПользователяПродолжение", ЭтотОбъект);		
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСуществующегоПользователяПродолжение(Пользователь, ДополнительныеПараметры) Экспорт
	
	Запись.Пользователь = Пользователь;
	
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Ложь;
		Элементы.Пользователь.Видимость                   = Истина;
	КонецЕсли;
	
	
КонецПроцедуры	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Истина;
		Элементы.Пользователь.Видимость = Ложь;
	Иначе
		Элементы.ГруппаДанныеНовогоПользователя.Видимость = Ложь;
		Элементы.Пользователь.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ДекорацияПредупреждение.Видимость = Запись.ИсходныйКлючЗаписи.Пустой();
	Элементы.ТабельныйНомер.Видимость = ЗначениеЗаполнено(Запись.ТабельныйНомер);

КонецПроцедуры

#КонецОбласти
